Hybrid-Memcached-(with-aggre)/ex2_result/memtier_4t_16t_default_datasize_178_cycle_100_result
16        Threads
50        Connections per thread
120       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        25564.65          ---          ---        31.04618        31.23100        41.72700        63.48700      5492.41 
Gets           20.00        20.00         0.00        30.31408        30.46300        40.44700        63.99900         4.71 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      25584.65        20.00         0.00        31.04560        31.23100        41.72700        63.48700      5497.11 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.015        0.000
SET      26.751        5.000
SET      27.647       10.000
SET      28.415       15.000
SET      29.183       20.000
SET      29.823       25.000
SET      30.207       30.000
SET      30.591       35.000
SET      30.847       40.000
SET      31.103       45.000
SET      31.231       50.000
SET      31.359       52.500
SET      31.487       55.000
SET      31.487       57.500
SET      31.615       60.000
SET      31.743       62.500
SET      31.871       65.000
SET      31.871       67.500
SET      31.999       70.000
SET      32.127       72.500
SET      32.255       75.000
SET      32.383       76.250
SET      32.383       77.500
SET      32.511       78.750
SET      32.511       80.000
SET      32.639       81.250
SET      32.767       82.500
SET      33.023       83.750
SET      33.023       85.000
SET      33.023       86.250
SET      33.279       87.500
SET      33.279       88.125
SET      33.535       88.750
SET      33.535       89.375
SET      33.535       90.000
SET      33.791       90.625
SET      33.791       91.250
SET      34.047       91.875
SET      34.047       92.500
SET      34.303       93.125
SET      34.559       93.750
SET      34.559       94.062
SET      34.815       94.375
SET      34.815       94.688
SET      35.071       95.000
SET      35.327       95.312
SET      35.583       95.625
SET      35.839       95.938
SET      36.095       96.250
SET      36.607       96.562
SET      37.119       96.875
SET      37.375       97.031
SET      37.631       97.188
SET      37.887       97.344
SET      38.143       97.500
SET      38.399       97.656
SET      38.655       97.812
SET      39.167       97.969
SET      39.423       98.125
SET      39.679       98.281
SET      40.191       98.438
SET      40.447       98.516
SET      40.447       98.594
SET      40.703       98.672
SET      40.959       98.750
SET      41.215       98.828
SET      41.471       98.906
SET      41.727       98.984
SET      41.983       99.062
SET      42.495       99.141
SET      43.007       99.219
SET      43.263       99.258
SET      43.775       99.297
SET      44.543       99.336
SET      45.567       99.375
SET      46.847       99.414
SET      48.639       99.453
SET      50.687       99.492
SET      52.479       99.531
SET      53.759       99.570
SET      54.783       99.609
SET      55.295       99.629
SET      55.807       99.648
SET      56.319       99.668
SET      56.831       99.688
SET      57.343       99.707
SET      58.111       99.727
SET      58.623       99.746
SET      59.391       99.766
SET      60.159       99.785
SET      60.671       99.805
SET      61.183       99.814
SET      61.439       99.824
SET      61.695       99.834
SET      61.951       99.844
SET      62.207       99.854
SET      62.463       99.863
SET      62.719       99.873
SET      62.975       99.883
SET      63.231       99.893
SET      63.487       99.902
SET      63.743       99.907
SET      63.743       99.912
SET      63.999       99.917
SET      64.255       99.922
SET      64.255       99.927
SET      64.511       99.932
SET      64.511       99.937
SET      64.767       99.941
SET      65.023       99.946
SET      65.279       99.951
SET      65.535       99.954
SET      66.047       99.956
SET      66.047       99.958
SET      66.559       99.961
SET      66.559       99.963
SET      67.071       99.966
SET      67.071       99.968
SET      67.583       99.971
SET      68.095       99.973
SET      68.607       99.976
SET      68.607       99.977
SET      69.119       99.978
SET      69.119       99.979
SET      69.631       99.980
SET      70.143       99.982
SET      70.655       99.983
SET      71.679       99.984
SET      73.215       99.985
SET      74.751       99.987
SET      77.823       99.988
SET      79.359       99.988
SET      80.895       99.989
SET      82.431       99.990
SET      83.967       99.990
SET      85.503       99.991
SET      95.743       99.991
SET     146.431       99.992
SET     195.583       99.993
SET     248.831       99.993
SET     305.151       99.994
SET     335.871       99.994
SET     368.639       99.995
SET     395.263       99.995
SET     434.175       99.995
SET     462.847       99.995
SET     491.519       99.996
SET     532.479       99.996
SET     565.247       99.996
SET     602.111       99.997
SET     643.071       99.997
SET     659.455       99.997
SET     675.839       99.997
SET     704.511       99.997
SET     724.991       99.998
SET     741.375       99.998
SET     761.855       99.998
SET     786.431       99.998
SET     802.815       99.998
SET     827.391       99.998
SET     843.775       99.998
SET     856.063       99.999
SET     860.159       99.999
SET     876.543       99.999
SET     884.735       99.999
SET     897.023       99.999
SET     909.311       99.999
SET     917.503       99.999
SET     925.695       99.999
SET     942.079       99.999
SET     950.271       99.999
SET     958.463       99.999
SET     962.559       99.999
SET     966.655       99.999
SET     974.847       99.999
SET     978.943       99.999
SET     983.039       99.999
SET     987.135      100.000
SET     995.327      100.000
SET     999.423      100.000
SET    1007.615      100.000
SET    1007.615      100.000
SET    1015.807      100.000
SET    1019.903      100.000
SET    1019.903      100.000
SET    1019.903      100.000
[...]
SET    1023.999      100.000
SET    1023.999      100.000
SET    1032.191      100.000
SET    1032.191      100.000
SET    1032.191      100.000
[...]
SET    1036.287      100.000
SET    1036.287      100.000
SET    1036.287      100.000
SET    1044.479      100.000
SET    1044.479      100.000
---
GET      18.047        0.000
GET      25.855        5.000
GET      26.751       10.000
GET      27.391       15.000
GET      27.903       20.000
GET      28.671       25.000
GET      29.183       30.000
GET      29.567       35.000
GET      29.823       40.000
GET      30.207       45.000
GET      30.463       50.000
GET      30.591       52.500
GET      30.719       55.000
GET      30.847       57.500
GET      30.975       60.000
GET      31.103       62.500
GET      31.231       65.000
GET      31.231       67.500
GET      31.359       70.000
GET      31.487       72.500
GET      31.615       75.000
GET      31.743       76.250
GET      31.743       77.500
GET      31.871       78.750
GET      31.871       80.000
GET      31.999       81.250
GET      32.127       82.500
GET      32.255       83.750
GET      32.383       85.000
GET      32.383       86.250
GET      32.639       87.500
GET      32.639       88.125
GET      32.767       88.750
GET      33.023       89.375
GET      33.023       90.000
GET      33.279       90.625
GET      33.279       91.250
GET      33.535       91.875
GET      33.535       92.500
GET      33.791       93.125
GET      34.047       93.750
GET      34.047       94.062
GET      34.303       94.375
GET      34.303       94.688
GET      34.559       95.000
GET      34.815       95.312
GET      35.071       95.625
GET      35.327       95.938
GET      35.583       96.250
GET      36.095       96.562
GET      36.351       96.875
GET      37.119       97.031
GET      37.375       97.188
GET      37.631       97.344
GET      37.887       97.500
GET      38.143       97.656
GET      38.399       97.812
GET      38.399       97.969
GET      38.655       98.125
GET      38.911       98.281
GET      39.679       98.438
GET      39.679       98.516
GET      39.935       98.594
GET      39.935       98.672
GET      39.935       98.750
GET      40.191       98.828
GET      40.447       98.906
GET      40.447       98.984
GET      40.703       99.062
GET      40.959       99.141
GET      41.727       99.219
GET      41.727       99.258
GET      41.983       99.297
GET      44.287       99.336
GET      44.287       99.375
GET      44.543       99.414
GET      50.687       99.453
GET      52.223       99.492
GET      52.991       99.531
GET      55.039       99.570
GET      56.575       99.609
GET      57.087       99.629
GET      57.087       99.648
GET      57.087       99.668
GET      57.087       99.688
GET      57.087       99.707
GET      58.623       99.727
GET      58.623       99.746
GET      60.159       99.766
GET      60.159       99.785
GET      61.951       99.805
GET      61.951       99.814
GET      61.951       99.824
GET      62.207       99.834
GET      62.207       99.844
GET      62.207       99.854
GET      62.207       99.863
GET      62.207       99.873
GET      63.999       99.883
GET      63.999       99.893
GET      63.999       99.902
GET      63.999       99.907
GET      63.999       99.912
GET      65.023       99.917
GET      65.023       99.922
GET      65.023       99.927
GET      65.023       99.932
GET      65.023       99.937
GET      65.023       99.941
GET      65.023       99.946
GET      65.023       99.951
GET      65.023       99.954
GET      65.023       99.956
GET      67.583       99.958
GET      67.583      100.000
---
WAIT      0.000      100.000